{
    "name": "SwinIR-M-x3 (classicalSR-DIV2K-s64w8)",
    "author": [
        "jingyunliang"
    ],
    "license": "Apache-2.0",
    "tags": [
        "compression-removal",
        "general-upscaler",
        "jpeg",
        "photo",
        "research",
        "restoration"
    ],
    "description": "[SwinIR: Image Restoration Using Swin Transformer](https://github.com/JingyunLiang/SwinIR)\n\n\nImage restoration is a long-standing low-level vision problem that aims to restore high-quality images from low-quality images (e.g., downscaled, noisy and compressed images). While state-of-the-art image restoration methods are based on convolutional neural networks, few attempts have been made with Transformers which show impressive performance on high-level vision tasks. In this paper, we propose a strong baseline model SwinIR for image restoration based on the Swin Transformer. SwinIR consists of three parts: shallow feature extraction, deep feature extraction and high-quality image reconstruction. In particular, the deep feature extraction module is composed of several residual Swin Transformer blocks (RSTB), each of which has several Swin Transformer layers together with a residual connection. We conduct experiments on three representative tasks: image super-resolution (including classical, lightweight and real-world image super-resolution), image denoising (including grayscale and color image denoising) and JPEG compression artifact reduction. Experimental results demonstrate that SwinIR outperforms state-of-the-art methods on different tasks by up to 0.14~0.45dB, while the total number of parameters can be reduced by up to 67%.",
    "date": "2021-08-26",
    "architecture": "swinir",
    "size": [
        "Medium",
        "s64",
        "w8"
    ],
    "scale": 3,
    "inputChannels": 3,
    "outputChannels": 3,
    "resources": [
        {
            "platform": "pytorch",
            "type": "pth",
            "size": 59758497,
            "sha256": "d835497f2332aae839ae19a033290ced8686fa2a795f76fc5153ec2c83003f75",
            "urls": [
                "https://github.com/JingyunLiang/SwinIR/releases/download/v0.0/001_classicalSR_DIV2K_s48w8_SwinIR-M_x3.pth"
            ]
        }
    ],
    "images": []
}