{
    "name": "DAT_x4",
    "author": "zheng-chen",
    "license": "Apache-2.0",
    "tags": [
        "research"
    ],
    "description": "Official 4x Pretrain of Dual Aggregation Transformer for Image Super-Resolution DAT\n\nTransformer has recently gained considerable popularity in low-level vision tasks, including image super-resolution (SR). These networks utilize self-attention along different dimensions, spatial or channel, and achieve impressive performance. This inspires us to combine the two dimensions in Transformer for a more powerful representation capability. Based on the above idea, we propose a novel Transformer model, Dual Aggregation Transformer (DAT), for image SR. Our DAT aggregates features across spatial and channel dimensions, in the inter-block and intra-block dual manner. Specifically, we alternately apply spatial and channel self-attention in consecutive Transformer blocks. The alternate strategy enables DAT to capture the global context and realize inter-block feature aggregation. Furthermore, we propose the adaptive interaction module (AIM) and the spatial-gate feed-forward network (SGFN) to achieve intra-block feature aggregation. AIM complements two self-attention mechanisms from corresponding dimensions. Meanwhile, SGFN introduces additional non-linear spatial information in the feed-forward network. Extensive experiments show that our DAT surpasses current methods.",
    "date": "2023-07-17",
    "architecture": "dat",
    "size": null,
    "scale": 4,
    "inputChannels": 3,
    "outputChannels": 3,
    "resources": [
        {
            "platform": "pytorch",
            "type": "pth",
            "size": 154692051,
            "sha256": "391a6ce69899dff5ea3214557e9d585608254579217169faf3d4c353caff049e",
            "urls": [
                "https://drive.google.com/file/d/1pEhXmg--IWHaZOwHUFdh7TEJqt2qeuYg"
            ]
        }
    ],
    "images": [
        {
            "type": "standalone",
            "url": "https://raw.githubusercontent.com/zhengchen1999/DAT/main/figs/DAT.png",
            "thumbnail": "/thumbs/small/6ffc0a9a20d4b1f68d75cee6.jpg"
        }
    ],
    "thumbnail": {
        "type": "standalone",
        "url": "/thumbs/110d52296f313b0387099636.jpg"
    }
}