{
    "name": "4x SPSR",
    "author": "cheng-ma",
    "license": null,
    "tags": [
        "general-upscaler",
        "photo",
        "research"
    ],
    "description": "[Structure-Preserving Super Resolution with Gradient Guidance](https://github.com/Maclory/SPSR)\n\nStructures matter in single image super resolution (SISR). Recent studies benefiting from generative adversarial network (GAN) have promoted the development of SISR by recovering photo-realistic images. However, there are always undesired structural distortions in the recovered images. In this paper, we propose a structure-preserving super resolution method to alleviate the above issue while maintaining the merits of GAN-based methods to generate perceptual-pleasant details. Specifically, we exploit gradient maps of images to guide the recovery in two aspects. On the one hand, we restore high-resolution gradient maps by a gradient branch to provide additional structure priors for the SR process. On the other hand, we propose a gradient loss which imposes a second-order restriction on the super-resolved images. Along with the previous image-space loss functions, the gradient-space objectives help generative networks concentrate more on geometric structures. Moreover, our method is model-agnostic, which can be potentially used for off-the-shelf SR networks. Experimental results show that we achieve the best PI and LPIPS performance and meanwhile comparable PSNR and SSIM compared with state-of-the-art perceptual-driven SR methods. Visual results demonstrate our superiority in restoring structures while generating natural SR images.",
    "date": "2020-03-31",
    "architecture": "spsr",
    "size": [
        "64nf",
        "23nb"
    ],
    "scale": 4,
    "inputChannels": 3,
    "outputChannels": 3,
    "resources": [
        {
            "platform": "pytorch",
            "type": "pth",
            "size": 99541339,
            "sha256": "7a9561579d06f1858898cc863251fc4d690e517b5b87f8be17f9f2ab6ebce5ab",
            "urls": [
                "https://drive.google.com/drive/folders/1c4EbfI6X4KzCiyg1H7TA6rJY-HVgvS3q?usp=sharing"
            ]
        }
    ],
    "images": [
        {
            "type": "standalone",
            "url": "https://github.com/Maclory/SPSR/raw/master/visual_results/fig4.png"
        }
    ]
}