{
    "c-animesharpv2": {
        "name": "AnimeSharpV2",
        "author": "kim2091",
        "description": "",
        "models": [
            "2x-AnimeSharpV2-RPLKSR-Sharp",
            "2x-AnimeSharpV2-RPLKSR-Soft",
            "2x-AnimeSharpV2-MoSR-Sharp",
            "2x-AnimeSharpV2-MoSR-Soft"
        ]
    },
    "c-animesharpv3": {
        "name": "AnimeSharpV3",
        "author": "kim2091",
        "description": "",
        "models": [
            "2x-AnimeSharpV3",
            "2x-AnimeSharpV3-RCAN"
        ]
    },
    "c-animesharpv4": {
        "name": "AnimeSharpV4",
        "author": "kim2091",
        "description": "",
        "models": [
            "2x-AnimeSharpV4",
            "2x-AnimeSharpV4-Fast-RCAN-PU"
        ]
    },
    "c-fallin": {
        "name": "Fallin",
        "author": "renarchi",
        "description": "",
        "models": [
            "2x-Fallin-Soft",
            "2x-Fallin-Strong"
        ]
    },
    "c-gameup": {
        "name": "GameUp",
        "description": "GameUp is a set of video upscaling models intended for upscaling and restoring video game footage",
        "models": [
            "2x-GameUpV2-TSCUNet",
            "2x-GameUpV2-TSCUNet-Small",
            "2x-GameUp-TSCUNet"
        ],
        "author": "kim2091"
    },
    "c-normal-map-upscaling": {
        "name": "Normal Map Upscaling",
        "description": "This collection contain my RG0 normal map upscaling models.\n\nAll models here are for upscaling *tangent-space* normal maps in RG0 format. RG0 means that the B channel is set to 0. These models will work not correctly if you give them images with non-zero B channel, so you either have to zero the B channel manually or use tool like chaiNNer to do it.\n\n## DDS Compression\n\nI made 3 versions: \n- Normal RG0 is for uncompressed normal map textures. Since it hasn't been trained on compression artifacts, it's highly sensitive to quantization artifacts and noise.\n- Normal RG0 BC1 is for BC1-compressed DDS normal map textures.\n- Normal RG0 BC7 is for BC7-compressed DDS normal map textures. This model sometimes produces images that aren't as sharp. In those cases, you can try the BC1 version to see whether it gives better results.",
        "models": [
            "4x-Normal-RG0-BC1",
            "4x-Normal-RG0-BC7",
            "4x-Normal-RG0"
        ],
        "author": "rundevelopment"
    },
    "c-pbrify": {
        "name": "PBRify",
        "description": "PBRify_Remix is an easy way to upscale and generate PBR textures using existing low quality textures. The dataset consists of ethically sourced textures from websites like ambientCG and Polyhaven, which sets it apart from most other models.\n\nIt's intended for use with RTX Remix (hence the name) but it'll work for other things as well.\n\nMore models and other tools can be found here: https://github.com/Kim2091/PBRify_Remix",
        "models": [
            "1x-PBRify-Height",
            "1x-PBRify-NormalV3",
            "1x-PBRify-RoughnessV2",
            "4x-PBRify-UpscalerSPANV4",
            "4x-PBRify-UpscalerSIR-M-V2",
            "4x-PBRify-UpscalerDAT2-V1",
            "4x-PBRify-RPLKSRd-V3",
            "4x-PBRify-UpscalerV4"
        ],
        "author": "kim2091"
    },
    "c-starsample-v2-0": {
        "name": "StarSample V2.0",
        "author": "derpy",
        "description": "**A collection of StarSample V2.0 models, now trained in a few architectures, rather than just one.**\n\nThe dataset for V2 is made completely from scratch (in relation to V1, but also in general), and includes what I'd consider many smaller datasets purpose-made to target areas where the models couldn't quite get up to the quality I wanted (particularly with focus on the heavier-weight models — the lighter architectures aren't really big enough for much effect). The improvement in dataset mostly, but also training heavier models has lead to a very large improvement, particularly with the \"HQ\" model.\n\nI wouldn't suggest using V1 over V2 in any circumstances — which I am very pleased to be able to say, having gone through at least 20 attempts to actually achieve that... somehow.",
        "models": [
            "2x-StarSample-V2-HQ",
            "2x-StarSample-V2",
            "2x-StarSample-V2-Lite",
            "1x-StarSample-V2-NS",
            "1x-StarSample-V2-Lite-NS"
        ]
    },
    "c-where-on-earth-is-carmen-sandiego-": {
        "name": "Where On Earth Is Carmen Sandiego?",
        "author": "pokepress",
        "description": "Collection of models for use in restoration and upscaling of the TV series \"Where on Earth is Carmen Sandiego?\" from the 1990s. While primarily consisting of cel-based animation, the show also incorporates live-action (including stock footage and scenes involving \"The Player\"), 3D CGI (primarily used for the C5 Corridor), and 2D computer animation. The models are divided into two groups:\n\n* Deinterlace Fix\n* Upscaling\n\nThe deinterlacing fix models are primarily designed for the 2012 Mill Creek release, where a number of episodes have some rather harsh forced deinterlacing, which the models attempt to repair. These models may also be useful for improving picture quality in some scenes (primarily in seasons 3 and 4) that used deinterlacing as part of compositing multiple layers of images, and for improving the results of deinterlacing by QTGMC or other processes.\n\nSpeaking of deinterlacing, for episodes in 480i, I recommend using QTGMC to deinterlace them to 60 (59.97) fps, the frame rate of the live-action and (some) C5 Corridor footage. For the pre-deinterlaced episodes, you're going to be stuck at 30 fps since the other-frame information has already been removed. Despite this series being primarily cel-based animation, I **don't** recommend using 24 fps as it tends to make higher-framerate portions look odd.\n\nThe upscaling models work pretty much how you would expect.\n\nEach model has a small and large variant. The large variants are based on the OmniSR architecture, and tend to produce better results (marginally so in the case of the deinterlacing fix), but are several times slower than the small models, which use the compact architecture.",
        "models": [
            "1x-WhereOnEarthDeintFixL",
            "1x-WhereOnEarthDeintFixS",
            "2x-Where-On-Earth-Upscale-Large",
            "2x-Where-On-Earth-Upscale-Small"
        ]
    }
}